In [42]:
import pandas as pd
import numpy as np
import glob
from datetime import datetime

## Ejercicio 0

Formatea una lista de meses, añadiendole un 0 a cada mes del 1 al 9

In [178]:
def formatearMes(meses: list):
    # Crear un diccionario con las claves del 1 al 9 y los valores en formato de dos dígitos
    diccionario = {i: f'{i:02}' for i in range(1, 10)}  
    meses_formateados = []
    # Iterar sobre la lista de meses
    for mes in meses:
        # Si el mes es menor que 10, usar el diccionario para formatearlo
        if mes in diccionario:
            meses_formateados.append(diccionario[mes])
        else:
            # Si el mes es 10 o mayor, agregarlo tal cual (asumimos que ya está en formato correcto)
            meses_formateados.append(f'{mes:02}')
    return meses_formateados

formatearMes([1,3,5,12,11,4,1])

['01', '03', '05', '12', '11', '04', '01']

## Ejercicio 1
Escribir un programa que pregunte al usuario por las ventas de un rango de años y muestre por pantalla una serie con los datos de las ventas indexada por los años, antes y después de aplicarles un descuento del 10%.

In [ ]:
inicio = 1995
fin = 2023
ventas = {} #Se guardan los datos en un diccionario y se pasa a pandas
cantidad = 0
for año in range(inicio, fin+1):
    cantidad += (100+10)
    descuento = (cantidad-cantidad*0.10)
    ventas[año] = descuento
tabla = pd.Series(ventas) #pasamos a serie
df = pd.DataFrame(tabla) #pasamos a datafranme
df.tail(10)

           0
2014  1980.0
2015  2079.0
2016  2178.0
2017  2277.0
2018  2376.0
2019  2475.0
2020  2574.0
2021  2673.0
2022  2772.0
2023  2871.0

## Ejercicio 2
Escribir una función que reciba un diccionario con las notas de los alumno de un curso y devuelva una serie con la nota mínima, la máxima, media y la desviación típica.

In [ ]:
def notas(alumnos: dict):
    tabla = pd.DataFrame.from_dict(alumnos, orient='index')
    minima = tabla.min()
    maxima = tabla.max()
    media = tabla.mean()
    desviacion = tabla.std()
    serie = pd.concat([minima, maxima, media, desviacion], axis=1)
    serie.columns = ['Min', 'Max', 'Mean', 'Std']
    return serie.squeeze() #lo convierte en una serie

In [ ]:
notas_alumnos = {'pepe': 6, 'ana': 8, 'rodolfo': 3, 'javi': 10, 'andres': 7}

In [ ]:
notas(notas_alumnos)

Min      3.000000
Max     10.000000
Mean     6.800000
Std      2.588436
Name: 0, dtype: float64

## Ejercicio 3
Escribir una función que reciba un diccionario con las notas de los alumnos de un curso y devuelva una serie con las notas de los alumnos aprobados ordenadas de mayor a menor.

In [ ]:
def notasAprobadasOrdenadas(alumnos: dict):
    tabla = pd.DataFrame.from_dict(alumnos, orient='index', columns = ['Notas'])
    #tabla['Alumnos'] = tabla.index
    #tabla = tabla[['Alumnos', 'Notas']] 
    #tabla.index = range(1, len(tabla) + 1)  # Establecer índice numérico
    return tabla[tabla['Notas']>=5].sort_values(by='Notas', ascending=False).squeeze()

In [ ]:
notasAprobadasOrdenadas(notas_alumnos)

javi      10
ana        8
andres     7
pepe       6
Name: Notas, dtype: int64

## Ejercicio 4
Escribir programa que genere y muestre por pantalla un DataFrame con los datos de la tabla siguiente:

In [ ]:
meses = []
ventas = []
gastos = []

for dato in range(4):
    mes = input('Introduce el mes: ')
    venta = int(input('Introduce la venta: '))
    gasto = int(input('Introduce el gasto: '))
    meses.append(mes)
    ventas.append(venta)
    gastos.append(gasto)

In [ ]:
meses

['enero', 'febrero', 'marzo', 'abril']

In [ ]:
ventas

[30500, 35600, 28300, 33900]

In [ ]:
gastos

[22000, 23400, 18100, 20700]

In [ ]:
resultados = pd.DataFrame(data={'Mes': meses, 'Ventas': ventas, 'Gastos': gastos})
resultados

       Mes  Ventas  Gastos
0    enero   30500   22000
1  febrero   35600   23400
2    marzo   28300   18100
3    abril   33900   20700

## Ejercicio 5
Escribir una función que reciba un DataFrame con el formato del ejercicio anterior, una lista de meses, y devuelva el balance (ventas - gastos) total en los meses indicados.

In [ ]:
def balance(resultados, meses):
    resultados['Balance'] = resultados['Ventas'] - resultados['Gastos']
    return resultados[resultados['Mes'].isin(meses)]['Balance'].sum() # Usamos isin para comprobar campos en listas

In [ ]:
balance(resultados, ['enero', 'febrero'])

20700

## Ejercicio 6
El fichero cotizacion.csv contiene las cotizaciones de las empresas del IBEX35 con las siguientes columnas: 
- nombre (nombre de la empresa), 
- Final (precio de la acción al cierre de bolsa), 
- Máximo (precio máximo de la acción durante la jornada), 
- Mínimo (precio mínimo de la acción durante la jornada), 
- volumen (Volumen al cierre de bolsa), 
- Efectivo (capitalización al cierre en miles de euros). 

Construir una función que construya un DataFrame a partir del fichero con el formato anterior y devuelva otro DataFrame con el mínimo, el máximo y la media de dada columna.

In [166]:
cotizaciones = pd.read_csv('data/cotizacion.csv', sep=';', decimal=',', thousands='.', index_col=0) # Se puede establecer los decimales y miles al leer los csv
cotizaciones

                   Final      Máximo      Mínimo   Volumen   Efectivo
Nombre
ACCIONA          95.9500     96.7500     94.4000     84962    8166.11
ACERINOX       8668.0000   8672.0000   8468.0000     88599    7633.81
ACS              37.2800     37.6600     37.2200    655982   24517.29
AENA            167.1000    167.5000    166.1000    133738   22336.10
AMADEUS          69.9600     70.6400     69.5600    640476   44795.47
ARCELORMIT.   14152.0000  14318.0000     14.0800    702841    9989.65
BA.SABADELL       1.0165   1033.0000      1.0165  12358512   12637.65
BA.SANTANDER      4.0200      4.0675      4.0100  36129692  145765.44
BANKIA         2249.0000   2262.0000   2224.0000   3024454    6803.54
BANKINTER         6.5600   6604.0000   6522.0000   1375976    9030.20
BBVA           5024.0000      5.0500   4969.0000  26447612  132560.15
CAIXABANK      2763.0000   2806.0000   2762.0000  13031097   36239.22
CELLNEX          30.1700     30.7000     30.1700    857237   25965.29
CIE AUTOMOT.     23.4400     23.7400     23.4000     99506    2343.09
ENAGAS           25.6000     25.6600     25.0700     84254   21524.77
ENCE           3882.0000   3974.0000   3846.0000   2099698    8219.83
ENDESA           22.9500     23.0300     22.6200   1236799   28233.46
FERROVIAL        21.6100     21.7200     21.3800   2065931   44656.05
GRIFOLS CL.A     23.3000     23.6000     23.2700    719503   16787.55
IAG               5.3000      5.4600   5292.0000   2155081   11561.95
IBERDROLA         8.4500      8.4500   8262.0000  15637958  131426.05
INDITEX          24.9300     25.1900     24.8700   2600144   65012.92
INDRA A           9.5600   9685.0000   9535.0000     39206    3755.57
INM.COLONIAL   9915.0000   9915.0000   9745.0000    671753    6640.38
MAPFRE         2654.0000   2654.0000      2.6200   3045972    8063.13
MEDIASET       6446.0000   6592.0000   6446.0000   2647557   17277.04
MELIA HOTELS      8.1400      8.1900      8.0200     48021    3914.93
MERLIN           12.0800     12.0800     11.8300    777543    9357.77
NATURGY          26.7000     26.7700     26.5300   2100737   55986.54
R.E.C.        19705.0000  19875.0000  19675.0000   1246171   24585.33
REPSOL        14515.0000  14605.0000     14.4600   5046648   73333.78
SIEMENS GAME     14.3300     14.3900  14155.0000   1054847   15084.56
TEC.REUNIDAS     23.0000     23.2000     22.7800      1221    2807.19
TELEFONICA     7204.0000   7256.0000   7185.0000   9913249   71564.99
VISCOFAN         48.4600     49.1200     48.4600      6771    3295.43

In [75]:
cotizaciones.info()

<class 'pandas.core.frame.DataFrame'>
Index: 35 entries, ACCIONA to VISCOFAN
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Final     35 non-null     float64
 1   Máximo    35 non-null     float64
 2   Mínimo    35 non-null     float64
 3   Volumen   35 non-null     int64
 4   Efectivo  35 non-null     float64
dtypes: float64(4), int64(1)
memory usage: 1.6+ KB

In [76]:
# Reemplazar comas por puntos en las columnas y convertirlas manualmente a float

#cotizaciones['Final'] = cotizaciones['Final'].str.replace(',', '.').str.replace('.', '')
#cotizaciones['Máximo'] = cotizaciones['Máximo'].str.replace(',', '.').str.replace('.', '')
#cotizaciones['Mínimo'] = cotizaciones['Mínimo'].str.replace(',', '.').str.replace('.', '')
#cotizaciones['Volumen'] = cotizaciones['Volumen'].str.replace(',', '.').str.replace('.', '')
#cotizaciones['Efectivo'] = cotizaciones['Efectivo'].str.replace(',', '.').str.replace('.', '')
#columnas_a_convertir = ['Final', 'Máximo', 'Mínimo', 'Volumen', 'Efectivo']
#cotizaciones[columnas_a_convertir] = cotizaciones[columnas_a_convertir].astype(float)

In [77]:
cotizaciones.describe()

              Final        Máximo        Mínimo       Volumen       Efectivo
count     35.000000     35.000000     35.000000  3.500000e+01      35.000000
mean    2796.768757   3170.113357   3136.510471  4.252279e+06   31767.778000
std     5007.267143   5160.834249   4804.485259  7.901060e+06   38100.607064
min        1.016500      4.067500      1.016500  1.221000e+03    2343.090000
25%       17.970000     23.115000     22.700000  3.871070e+05    8114.620000
50%       30.170000     49.120000     48.460000  1.236799e+06   16787.550000
75%     3322.500000   5283.000000   5869.000000  2.836006e+06   40447.635000
max    19705.000000  19875.000000  19675.000000  3.612969e+07  145765.440000

## Ejercicio 7
El fichero titanic.csv contiene información sobre los pasajeros del Titanic. Escribir un programa con los siguientes requisitos:

1. Generar un DataFrame con los datos del fichero.

2. Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las 10 primeras filas y las 10 últimas filas.

3. Mostrar por pantalla los datos del pasajero con identificador 148.
4. Mostrar por pantalla las filas pares del DataFrame.
5. Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.
6. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron.
7. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.
8. Eliminar del DataFrame los pasajeros con edad desconocida.
9. Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase.
10. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.
11. Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.


1. Generar un DataFrame con los datos del fichero.

In [6]:
titanic = pd.read_csv('data/titanic.csv')

2. Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las 10 primeras filas y las 10 últimas filas.

In [7]:
titanic.shape

(891, 12)

In [8]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [10]:
titanic.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

3. Mostrar por pantalla los datos del pasajero con identificador 148.

In [11]:
titanic.loc[147]

PassengerId                                 148
Survived                                      0
Pclass                                        3
Name           Ford, Miss. Robina Maggie "Ruby"
Sex                                      female
Age                                         9.0
SibSp                                         2
Parch                                         2
Ticket                               W./C. 6608
Fare                                     34.375
Cabin                                       NaN
Embarked                                      S
Name: 147, dtype: object

4. Mostrar por pantalla las filas pares del DataFrame.

In [12]:
# Filtrar las filas con índices pares
filas_pares = titanic.iloc[::2] # de dos en dos
filas_pares

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

5. Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.

In [13]:
primera_clase = titanic[titanic['Pclass']==1].sort_values(by='Name')
primera_clase

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S
460,461,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S
...,...,...,...,...,...,...,...,...,...,...,...,...
155,156,0,1,"Williams, Mr. Charles Duane",male,51.00,0,1,PC 17597,61.3792,NaN,C
351,352,0,1,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0,0,113510,35.0000,C128,S
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
555,556,0,1,"Wright, Mr. George",male,62.00,0,0,113807,26.5500,NaN,S
325,326,1,1,"Young, Miss. Marie Grice",female,36.00,0,0,PC 17760,135.6333,C32,C

6. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron.

In [14]:
supervivientes = titanic['Survived'].sum()
porcentaje_supervivientes = supervivientes/len(titanic)
porcentaje_supervivientes

0.3838383838383838

7. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.

In [15]:
supervivientes_clase = pd.pivot_table(titanic, values='Survived', index=['Pclass'], aggfunc='sum')

In [16]:
clase1 = len(titanic[titanic['Pclass']==1])
clase2 = len(titanic[titanic['Pclass']==2])
clase3 = len(titanic[titanic['Pclass']==3])

clase1, clase2, clase3

(216, 184, 491)

In [17]:
supervivientes_clase['Total'] = [clase1, clase2, clase3]
supervivientes_clase['Porcentaje'] = round((supervivientes_clase['Survived']/supervivientes_clase['Total'])*100, 2)
supervivientes_clase

        Survived  Total  Porcentaje
Pclass
1            136    216       62.96
2             87    184       47.28
3            119    491       24.24

8. Eliminar del DataFrame los pasajeros con edad desconocida.

In [18]:
titanic2 = titanic['Age'].dropna()
titanic2

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64

9. Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase.

In [19]:

women_df = titanic[titanic["Sex"] == "female"] #Se parte en dos la tarea, primero se divide por mujer y luego se agrupa por clase para averiguar la edad

In [20]:
by_class = women_df.groupby('Pclass').agg({'Age': 'mean'}).reset_index()
by_class

   Pclass        Age
0       1  34.611765
1       2  28.722973
2       3  21.750000

10. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.

In [21]:
condicion = titanic['Age']<18
titanic['IsMinor'] = condicion
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,IsMinor
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,False
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,False
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,False

11. Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [22]:

titanic['Young'] = titanic['Age'] < 18

In [23]:
# Mostrar el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.
print(titanic.groupby(['Pclass', 'Young'])['Survived'].value_counts(normalize = True) * 100)

Pclass  Young  Survived
1       False  1           61.274510
               0           38.725490
        True   1           91.666667
               0            8.333333
2       False  0           59.006211
               1           40.993789
        True   1           91.304348
               0            8.695652
3       False  0           78.208232
               1           21.791768
        True   0           62.820513
               1           37.179487
Name: proportion, dtype: float64

## Ejercicio 8
Los ficheros emisiones-2016.csv, emisiones-2017.csv, emisiones-2018.csv y emisiones-2019.csv, contienen datos sobre las emisiones contaminates en la ciudad de Madrid en los años 2016, 2017, 2018 y 2019 respectivamente. Escribir un programa con los siguientes requisitos:

1. Generar un DataFrame con los datos de los cuatro ficheros.
2. Filtrar las columnas del DataFrame para quedarse con las columnas ESTACION, MAGNITUD, AÑO, MES y las correspondientes a los días D01, D02, etc.
3. Reestructurar el DataFrame para que los valores de los contaminantes de las columnas de los días aparezcan en una única columna.
4. Añadir una columna con la fecha a partir de la concatenación del año, el mes y el día (usar el módulo datetime).
5. Eliminar las filas con fechas no válidas (utilizar la función isnat del módulo numpy) y ordenar el DataFrame por estaciones contaminantes y fecha.
6. Mostrar por pantalla las estaciones y los contaminantes disponibles en el DataFrame.
7. Crear una función que reciba una estación, un contaminante y un rango de fechas y devuelva una serie con las emisiones del contaminante dado en la estación y rango de fechas dado.
8. Mostrar un resumen descriptivo (mínimo, máximo, media, etc.) para cada contaminante.
9. Mostrar un resumen descriptivo para cada contaminante por distritos.
10. Crear una función que reciba una estación y un contaminante y devuelva un resumen descriptivo de las emisiones del contaminante indicado en la estación indicada.
11. Crear una función que devuelva las emisiones medias mensuales de un contaminante y un año dados para todos las estaciones.
12. Crear un función que reciba una estación de medición y devuelva un DataFrame con las medias mensuales de los distintos tipos de contaminantes.

1. Generar un DataFrame con los datos de los cuatro ficheros.

In [24]:
def ConcatenarCSV(ruta):
    """
    Concatena varios archivos CSV en uno solo.

    Argumentos:
    - ruta: Ruta del directorio que contiene los archivos CSV a concatenar.

    Retorna:
    - DataFrame: Un DataFrame que contiene todos los datos de los archivos CSV concatenados.
    """
    archivos = glob.glob(ruta + "/*.csv")
    print(len(archivos))
    lista = []

    for csv in archivos:
        df = pd.read_csv(csv, index_col=None, header=0, sep=';')
        lista.append(df)

    df = pd.concat(lista, axis=0, ignore_index=True)
    
    return df

In [25]:
ruta = r'data/ejerciciosPandas/'

In [26]:
df = ConcatenarCSV(ruta)

4

In [27]:
df.head(10)

,PROVINCIA,MUNICIPIO,ESTACION,MAGNITUD,PUNTO_MUESTREO,ANO,MES,D01,V01,D02,...,D27,V27,D28,V28,D29,V29,D30,V30,D31,V31
0,28,79,4,1,28079004_1_38,2016,1,8.0,V,7.0,...,9.0,V,7.0,V,8.0,V,9.0,V,9.0,V
1,28,79,4,1,28079004_1_38,2016,2,12.0,V,13.0,...,7.0,V,8.0,V,9.0,V,0.0,N,0.0,N
2,28,79,4,1,28079004_1_38,2016,3,11.0,V,10.0,...,8.0,V,7.0,V,8.0,V,10.0,V,8.0,V
3,28,79,4,1,28079004_1_38,2016,4,8.0,V,9.0,...,9.0,V,8.0,V,8.0,V,8.0,V,0.0,N
4,28,79,4,1,28079004_1_38,2016,5,7.0,V,8.0,...,7.0,V,7.0,V,7.0,V,7.0,V,7.0,V
5,28,79,4,1,28079004_1_38,2016,6,7.0,V,7.0,...,7.0,V,7.0,V,8.0,V,8.0,V,0.0,N
6,28,79,4,1,28079004_1_38,2016,7,8.0,V,7.0,...,7.0,V,7.0,V,7.0,V,7.0,V,7.0,V
7,28,79,4,1,28079004_1_38,2016,8,7.0,V,7.0,...,7.0,V,7.0,V,7.0,V,7.0,V,7.0,V
8,28,79,4,1,28079004_1_38,2016,9,7.0,V,8.0,...,8.0,V,8.0,V,9.0,V,9.0,V,0.0,N
9,28,79,4,1,28079004_1_38,2016,10,9.0,V,8.0,...,5.0,V,4.0,V,4.0,V,6.0,V,7.0,V

2. Filtrar las columnas del DataFrame para quedarse con las columnas ESTACION, MAGNITUD, AÑO, MES y las correspondientes a los días D01, D02, etc.

In [28]:
df_filtrado = df.loc[:, 'ESTACION' : 'D31' ]
df_filtrado.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7266 entries, 0 to 7265
Data columns (total 66 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ESTACION        7266 non-null   int64
 1   MAGNITUD        7266 non-null   int64
 2   PUNTO_MUESTREO  7266 non-null   object
 3   ANO             7266 non-null   int64
 4   MES             7266 non-null   int64
 5   D01             7266 non-null   float64
 6   V01             7266 non-null   object
 7   D02             7266 non-null   float64
 8   V02             7266 non-null   object
 9   D03             7266 non-null   float64
 10  V03             7266 non-null   object
 11  D04             7266 non-null   float64
 12  V04             7266 non-null   object
 13  D05             7266 non-null   float64
 14  V05             7266 non-null   object
 15  D06             7266 non-null   float64
 16  V06             7266 non-null   object
 17  D07             7266 non-null   float64
 18  V07             7266 non-null   object
 19  D08             7266 non-null   float64
 20  V08             7266 non-null   object
 21  D09             7266 non-null   float64
 22  V09             7266 non-null   object
 23  D10             7266 non-null   float64
 24  V10             7266 non-null   object
 25  D11             7266 non-null   float64
 26  V11             7266 non-null   object
 27  D12             7266 non-null   float64
 28  V12             7266 non-null   object
 29  D13             7266 non-null   float64
 30  V13             7266 non-null   object
 31  D14             7266 non-null   float64
 32  V14             7266 non-null   object
 33  D15             7266 non-null   float64
 34  V15             7266 non-null   object
 35  D16             7266 non-null   float64
 36  V16             7266 non-null   object
 37  D17             7266 non-null   float64
 38  V17             7266 non-null   object
 39  D18             7266 non-null   float64
 40  V18             7266 non-null   object
 41  D19             7266 non-null   float64
 42  V19             7266 non-null   object
 43  D20             7266 non-null   float64
 44  V20             7266 non-null   object
 45  D21             7266 non-null   float64
 46  V21             7266 non-null   object
 47  D22             7266 non-null   float64
 48  V22             7266 non-null   object
 49  D23             7266 non-null   float64
 50  V23             7266 non-null   object
 51  D24             7266 non-null   float64
 52  V24             7266 non-null   object
 53  D25             7266 non-null   float64
 54  V25             7266 non-null   object
 55  D26             7266 non-null   float64
 56  V26             7266 non-null   object
 57  D27             7266 non-null   float64
 58  V27             7266 non-null   object
 59  D28             7266 non-null   float64
 60  V28             7266 non-null   object
 61  D29             7266 non-null   float64
 62  V29             7266 non-null   object
 63  D30             7266 non-null   float64
 64  V30             7266 non-null   object
 65  D31             7266 non-null   float64
dtypes: float64(31), int64(4), object(31)
memory usage: 3.7+ MB

In [29]:
# Eliminar columnas de tipo 'object'
df_filtrado = df_filtrado.select_dtypes(exclude=['object'])
df_filtrado

,ESTACION,MAGNITUD,ANO,MES,D01,D02,D03,D04,D05,D06,...,D22,D23,D24,D25,D26,D27,D28,D29,D30,D31
0,4,1,2016,1,8.0,7.0,6.0,6.0,7.0,6.0,...,10.0,11.0,11.0,13.0,12.0,9.0,7.0,8.0,9.0,9.0
1,4,1,2016,2,12.0,13.0,9.0,9.0,11.0,9.0,...,11.0,10.0,9.0,8.0,7.0,7.0,8.0,9.0,0.0,0.0
2,4,1,2016,3,11.0,10.0,9.0,9.0,7.0,8.0,...,8.0,8.0,9.0,9.0,9.0,8.0,7.0,8.0,10.0,8.0
3,4,1,2016,4,8.0,9.0,9.0,8.0,8.0,9.0,...,8.0,8.0,8.0,8.0,9.0,9.0,8.0,8.0,8.0,0.0
4,4,1,2016,5,7.0,8.0,9.0,9.0,8.0,8.0,...,7.0,7.0,8.0,7.0,7.0,7.0,7.0,7.0,7.0,7.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7261,60,14,2019,8,94.0,104.0,106.0,99.0,77.0,82.0,...,86.0,97.0,104.0,96.0,85.0,88.0,90.0,99.0,108.0,98.0
7262,60,14,2019,9,88.0,82.0,80.0,92.0,79.0,75.0,...,59.0,46.0,49.0,69.0,57.0,54.0,68.0,70.0,55.0,0.0
7263,60,14,2019,10,44.0,75.0,44.0,54.0,65.0,68.0,...,37.0,39.0,45.0,21.0,23.0,28.0,33.0,16.0,19.0,47.0
7264,60,14,2019,11,41.0,55.0,79.0,65.0,64.0,51.0,...,38.0,75.0,69.0,45.0,35.0,55.0,52.0,47.0,56.0,0.0
7265,60,14,2019,12,47.0,53.0,45.0,44.0,49.0,41.0,...,68.0,36.0,9.0,11.0,10.0,17.0,13.0,14.0,5.0,4.0

3. Reestructurar el DataFrame para que los valores de los contaminantes de las columnas de los días aparezcan en una única columna.

In [30]:
'''
cols_sumar = df_filtrado.loc[:, 'D01' : 'D31' ]
df_filtrado['VALORES FINALES'] = cols_sumar.sum(axis=1)
df_filtrado2 = df_filtrado.drop(cols_sumar, axis=1)
df_filtrado2
'''

"\ncols_sumar = df_filtrado.loc[:, 'D01' : 'D31' ]\ndf_filtrado['VALORES FINALES'] = cols_sumar.sum(axis=1)\ndf_filtrado2 = df_filtrado.drop(cols_sumar, axis=1)\ndf_filtrado2\n"

In [31]:
# Reestructurar el DataFrame para que los valores de los contaminantes de las columnas de los días aparezcan en una única columna.
emisiones = df_filtrado.melt(id_vars=['ESTACION', 'MAGNITUD', 'ANO', 'MES'], var_name='DIA', value_name='VALOR')
emisiones

        ESTACION  MAGNITUD   ANO  MES  DIA  VALOR
0              4         1  2016    1  D01    8.0
1              4         1  2016    2  D01   12.0
2              4         1  2016    3  D01   11.0
3              4         1  2016    4  D01    8.0
4              4         1  2016    5  D01    7.0
...          ...       ...   ...  ...  ...    ...
225241        60        14  2019    8  D31   98.0
225242        60        14  2019    9  D31    0.0
225243        60        14  2019   10  D31   47.0
225244        60        14  2019   11  D31    0.0
225245        60        14  2019   12  D31    4.0

[225246 rows x 6 columns]

4. Añadir una columna con la fecha a partir de la concatenación del año, el mes y el día (usar el módulo datetime).

In [32]:
#Formateamos el string de la fecha
emisiones['DIA'] = emisiones.DIA.str.replace("D", "")
emisiones['DIA'] = emisiones.DIA.str.lstrip()

In [33]:
emisiones['MES']=  emisiones.MES.apply(lambda x : f'{int(x):02}')

In [34]:
emisiones['FECHA'] = pd.to_datetime(emisiones['ANO'].astype(str) + '-' + emisiones['MES'].astype(str) + '-' + emisiones['DIA'].astype(str), errors='coerce')
emisiones

        ESTACION  MAGNITUD   ANO MES DIA  VALOR      FECHA
0              4         1  2016  01  01    8.0 2016-01-01
1              4         1  2016  02  01   12.0 2016-02-01
2              4         1  2016  03  01   11.0 2016-03-01
3              4         1  2016  04  01    8.0 2016-04-01
4              4         1  2016  05  01    7.0 2016-05-01
...          ...       ...   ...  ..  ..    ...        ...
225241        60        14  2019  08  31   98.0 2019-08-31
225242        60        14  2019  09  31    0.0        NaT
225243        60        14  2019  10  31   47.0 2019-10-31
225244        60        14  2019  11  31    0.0        NaT
225245        60        14  2019  12  31    4.0 2019-12-31

[225246 rows x 7 columns]

5. Eliminar las filas con fechas no válidas (utilizar la función isnat del módulo numpy) y ordenar el DataFrame por estaciones contaminantes y fecha.

In [35]:
emisiones = emisiones.drop(emisiones[np.isnat(emisiones.FECHA)].index) #drop(df[col])
emisiones.sort_values(['ESTACION', 'FECHA'])

        ESTACION  MAGNITUD   ANO MES DIA  VALOR      FECHA
0              4         1  2016  01  01    8.0 2016-01-01
12             4         6  2016  01  01    0.4 2016-01-01
24             4         7  2016  01  01   28.0 2016-01-01
36             4         8  2016  01  01   40.0 2016-01-01
48             4        12  2016  01  01   83.0 2016-01-01
...          ...       ...   ...  ..  ..    ...        ...
225197        60         7  2019  12  31   77.0 2019-12-31
225209        60         8  2019  12  31   83.0 2019-12-31
225221        60        10  2019  12  31   25.0 2019-12-31
225233        60        12  2019  12  31  202.0 2019-12-31
225245        60        14  2019  12  31    4.0 2019-12-31

[221158 rows x 7 columns]

6. Mostrar por pantalla las estaciones y los contaminantes disponibles en el DataFrame.

In [36]:
emisiones['ESTACION'].unique()

array([ 4,  8, 11, 16, 17, 18, 24, 27, 35, 36, 38, 39, 40, 47, 48, 49, 50,
       54, 55, 56, 57, 58, 59, 60], dtype=int64)

In [37]:
emisiones['MAGNITUD'].unique()

array([ 1,  6,  7,  8, 12,  9, 10, 14, 20, 30, 35, 42, 43, 44],
      dtype=int64)

7. Crear una función que reciba una estación, un contaminante y un rango de fechas y devuelva una serie con las emisiones del contaminante dado en la estación y rango de fechas dado.

In [49]:
def serieContaminantePorEstacionYFecha(estacion, contaminante, inicioFecha, finFecha):
    return emisiones[(emisiones['ESTACION']==estacion) & (emisiones['MAGNITUD']== contaminante) & (emisiones['FECHA']>=inicioFecha) & (emisiones['FECHA']<=finFecha)].sort_values('FECHA')

In [50]:
serieContaminantePorEstacionYFecha(56, 8, datetime.strptime('2018/10/25', '%Y/%m/%d'), datetime.strptime('2019/02/12', '%Y/%m/%d'))

        ESTACION  MAGNITUD   ANO MES DIA  VALOR      FECHA
179559        56         8  2018  10  25   89.0 2018-10-25
186825        56         8  2018  10  26   87.0 2018-10-26
194091        56         8  2018  10  27   46.0 2018-10-27
201357        56         8  2018  10  28   38.0 2018-10-28
208623        56         8  2018  10  29   29.0 2018-10-29
...          ...       ...   ...  ..  ..    ...        ...
57841         56         8  2019  02  08   82.0 2019-02-08
65107         56         8  2019  02  09   64.0 2019-02-09
72373         56         8  2019  02  10   26.0 2019-02-10
79639         56         8  2019  02  11   59.0 2019-02-11
86905         56         8  2019  02  12   71.0 2019-02-12

[111 rows x 7 columns]

8. Mostrar un resumen descriptivo (mínimo, máximo, media, etc.) para cada contaminante.

In [40]:
emisiones.groupby('MAGNITUD').VALOR.describe()

            count       mean         std   min    25%    50%    75%       max
MAGNITUD
1         14610.0   7.428953    7.012504  0.00   4.00   7.00  10.00    610.00
6         14610.0   0.350233    0.215935  0.00   0.20   0.30   0.40     14.90
7         35064.0  20.446412  135.123509  0.00   4.00   9.00  23.00  24742.00
8         35064.0  37.677618   20.118050  0.00  22.00  35.00  50.00    148.00
9          8948.0  10.087729   10.643591  0.00   6.00   9.00  13.00    850.00
10        17897.0  18.772923   35.723619  0.00  10.00  16.00  24.00   4481.00
12        35064.0  67.959417   61.443940  0.00  29.00  48.00  84.00   1005.00
14        20454.0  49.941772   24.753120  0.00  31.00  52.00  69.00    336.00
20         8766.0   2.364944    4.236706  0.00   0.80   1.60   2.80    195.00
30         8766.0   0.531371    0.538180  0.00   0.20   0.40   0.70     15.10
35         8766.0   0.479751    1.183618  0.00   0.10   0.20   0.50     35.70
42         4383.0   1.400897    0.251836 -0.01   1.25   1.38   1.54      3.09
43         4383.0   1.292923    0.230898 -0.14   1.17   1.28   1.43      2.77
44         4383.0   0.108941    0.068776  0.00   0.06   0.10   0.14      1.31

9. Mostrar un resumen descriptivo para cada contaminante por distritos.

In [52]:
emisiones.groupby(['ESTACION', 'MAGNITUD']).VALOR.describe()

                    count       mean        std  min   25%   50%    75%    max
ESTACION MAGNITUD
4        1         1461.0   7.329911  16.379050  1.0   4.0   7.0    9.0  610.0
         6         1461.0   0.411499   0.172902  0.1   0.3   0.4    0.5    1.3
         7         1461.0  31.939767  37.667968  0.0   8.0  16.0   42.0  239.0
         8         1461.0  44.398357  17.766063  0.0  31.0  43.0   55.0  105.0
         12        1461.0  93.341547  72.436531  0.0  44.0  69.0  119.0  467.0
...                   ...        ...        ...  ...   ...   ...    ...    ...
60       7         1461.0  12.326489  19.593109  1.0   2.0   4.0   12.0  151.0
         8         1461.0  31.125941  18.101896  3.0  18.0  27.0   41.0  101.0
         10        1461.0  17.033539  12.205022  1.0   9.0  14.0   21.0  215.0
         12        1461.0  50.023956  45.933843  6.0  22.0  33.0   60.0  328.0
         14        1461.0  60.718001  26.309952  4.0  42.0  65.0   81.0  119.0

[153 rows x 8 columns]

10. Crear una función que reciba una estación y un contaminante y devuelva un resumen descriptivo de las emisiones del contaminante indicado en la estación indicada.

In [57]:
def resumenEmisiones(estacion, contaminante):
    return emisiones[(emisiones['ESTACION']==estacion) & (emisiones['MAGNITUD']== contaminante)].VALOR.describe()

# Resumen de Dióxido de Nitrógeno en Plaza Elíptica
resumenEmisiones(56, 8)

count    1461.000000
mean       55.113621
std        21.911483
min         0.000000
25%        39.000000
50%        53.000000
75%        69.000000
max       142.000000
Name: VALOR, dtype: float64

11. Crear una función que devuelva las emisiones medias mensuales de un contaminante y un año dados para todos las estaciones.

In [62]:
def mediasMensualesContaminantes(contaminante, año):
    return emisiones[(emisiones['ANO']==año) & (emisiones['MAGNITUD']== contaminante)].groupby(['ESTACION', 'MES']).VALOR.mean().unstack('MES')

mediasMensualesContaminantes(8, 2019)

MES,01,02,03,04,05,06,07,08,09,10,11,12
ESTACION,,,,,,,,,,,,
4,61.129032,62.000000,44.677419,36.033333,33.451613,36.700000,36.838710,34.064516,35.400000,33.451613,21.800000,40.806452
8,74.516129,77.071429,57.064516,48.466667,43.032258,41.933333,36.387097,24.612903,45.233333,55.000000,42.033333,49.870968
11,58.516129,59.571429,37.709677,32.066667,26.064516,31.733333,33.451613,28.322581,36.966667,48.451613,31.800000,47.612903
16,54.387097,56.892857,35.451613,27.933333,20.354839,24.666667,25.258065,24.548387,31.266667,41.935484,29.500000,40.677419
17,65.967742,70.142857,43.161290,29.400000,22.548387,25.133333,27.161290,29.322581,36.933333,47.774194,30.566667,44.516129
18,55.161290,54.821429,35.645161,24.300000,19.967742,21.033333,22.322581,23.419355,25.833333,41.225806,25.400000,39.193548
24,37.516129,38.464286,21.645161,13.100000,10.806452,12.000000,13.322581,13.903226,20.600000,27.000000,12.166667,26.258065
27,47.580645,48.214286,35.709677,27.566667,22.903226,26.233333,27.032258,31.677419,35.966667,49.000000,30.133333,45.774194
35,54.548387,51.857143,31.903226,21.700000,22.548387,26.033333,35.322581,33.096774,37.533333,45.193548,30.133333,41.483871
36,58.870968,58.678571,37.645161,29.333333,21.354839,24.800000,25.677419,25.935484,31.500000,43.838710,32.300000,43.354839
38,62.193548,59.357143,38.032258,29.333333,25.935484,25.366667,22.096774,21.161290,37.033333,47.064516,29.200000,45.870968
39,63.354839,62.214286,37.483871,25.566667,19.483871,25.200000,25.483871,24.870968,30.466667,47.290323,27.133333,42.774194
40,58.967742,57.357143,36.387097,28.433333,21.967742,24.033333,26.419355,26.548387,34.733333,44.580645,30.966667,41.709677
47,53.548387,52.571429,36.322581,23.600000,21.354839,18.966667,23.903226,26.806452,33.666667,43.645161,26.733333,39.193548
48,55.709677,57.178571,34.677419,26.466667,17.967742,24.633333,24.903226,20.870968,27.333333,43.967742,33.666667,43.000000
49,45.580645,42.035714,25.870968,17.366667,14.354839,13.900000,16.129032,16.322581,19.433333,31.838710,22.200000,33.935484
50,57.741935,56.214286,36.741935,32.466667,24.000000,30.233333,28.967742,26.258065,32.233333,44.709677,31.766667,41.709677
54,60.774194,59.321429,38.354839,27.900000,24.645161,22.066667,23.806452,26.225806,34.266667,46.967742,32.900000,45.967742
55,63.548387,61.750000,44.161290,31.233333,25.419355,26.633333,26.064516,28.225806,32.833333,45.000000,27.833333,44.064516
56,77.483871,82.428571,61.064516,46.900000,44.032258,41.100000,45.838710,44.580645,52.100000,57.225806,35.133333,51.903226
57,53.967742,52.321429,31.290323,25.000000,17.354839,20.766667,21.903226,21.677419,25.900000,37.806452,26.000000,38.193548
58,24.774194,24.071429,15.483871,11.166667,9.483871,12.266667,12.322581,12.935484,15.433333,21.645161,11.900000,18.935484
59,39.064516,40.964286,25.322581,19.666667,13.741935,16.833333,14.225806,14.774194,22.866667,35.290323,23.400000,32.387097
60,42.032258,44.750000,25.129032,21.033333,14.580645,18.233333,22.000000,16.096774,19.466667,20.806452,15.733333,42.870968

12. Crear un función que reciba una estación de medición y devuelva un DataFrame con las medias mensuales de los distintos tipos de contaminantes.

In [66]:
def mediasMensualesContaminantes(estacion):
    # Filtrar el DataFrame por la estación específica
    df_filtrado = emisiones[emisiones['ESTACION'] == estacion]
    # Agrupar por magnitud y mes, y calcular la media de los valores
    medias_mensuales = df_filtrado.groupby(['MAGNITUD', 'MES']).VALOR.mean().unstack('MES')
    return medias_mensuales

mediasMensualesContaminantes(40)

MES,01,02,03,04,05,06,07,08,09,10,11,12
MAGNITUD,,,,,,,,,,,,
1,8.379032,7.628319,7.314516,6.816667,6.177419,6.541667,5.870968,5.854839,6.766667,6.403226,6.958333,8.443548
7,33.153226,20.920354,11.233871,6.883333,5.524194,5.058333,4.911290,4.040323,9.000000,17.185484,26.300000,39.500000
8,52.766129,46.221239,37.064516,31.008333,28.790323,28.025000,29.354839,27.290323,38.333333,46.677419,47.066667,53.161290
10,17.532258,22.460177,13.346774,51.916667,14.612903,22.233333,25.080645,25.983871,21.916667,21.774194,16.358333,18.056452
12,103.629032,78.203540,54.322581,41.658333,37.290323,35.875000,36.854839,33.411290,52.166667,72.959677,87.375000,113.677419